export const generationColors = {
  "カントー": "#ef5350",
  "ジョウト": "#ffa726",
  "ホウエン": "#66bb6a",
  "シンオウ": "#42a5f5",
  "イッシュ": "#78909c",
  "カロス": "#ab47bc",
  "アローラ": "#ffee58",
  "ガラル": "#26a69a",
  "パルデア": "#ec407a"
};

export const typeColors = {
  "ノーマル": "#8A8B8B",
  "ほのお": "#E62D2D",
  "みず": "#4359FF",
  "くさ": "#50C850",
  "でんき": "#FFD700",
  "こおり": "#80D0D0",
  "かくとう": "#C03028",
  "どく": "#964096",
  "じめん": "#D8C070",
  "ひこう": "#A890F0",
  "エスパー": "#FF80B0",
  "むし": "#A8B820",
  "いわ": "#B8A038",
  "ゴースト": "#682868",
  "ドラゴン": "#78C0F0",
  "あく": "#684838",
  "はがね": "#A8A8C0",
  "フェアリー": "#EE99AC"
};
